{
    "1": {
        "common_name": "Pink Primrose",
        "genus": "Oenothera",
        "species": "speciosa",
        "wiki_info": "Oenothera speciosa is a species of evening primrose known by several common names, including pinkladies, pink evening primrose, showy evening primrose, Mexican primrose, and amapola. It is a herbaceous perennial wildflower native to 28 of the lower 48 U.S. states (Alabama, Arkansas, Arizona, California, the Carolinas, Connecticut, Florida, Georgia, Iowa, Illinois, Indiana, Kansas, Kentucky, Louisiana, Missouri, Mississippi, Nebraska, New Mexico, Ohio, Oklahoma, Pennsylvania, Tennessee, Texas, Utah, Virginia, and West Virginia) as well as Chihuahua and Coahuila in Mexico. It frequently escapes from gardens. The specific name, speciosa, means \"showy\".\nThe pink primrose has glaborous (smooth) to pubescent stems that grow to 50 cm in height. The pubescent leaves are alternate with very short or no petiole (sessile), reaching 10 cm long to 4 cm broad. They are variable in shape, from linear to obovate, and are toothed or wavy-edged. It produces single, four-petaled, cup-shaped flowers on the upper leaf axils. These fragrant shell-pink flowers bloom throughout the summer into early autumn. The 1.5–2 in (3.8–5.1 cm) flowers start out white and grow pink as they age. The flower throats, as well as the stigmas and stamens, have a soft yellow color. It blooms both day and night, but typically in the pre-dawn hours, closing when the full sun hits them. They bloom from March to July, and occasionally in the fall. The flowers are frequented by several species of insect, but moths are the most common as the flowers are mostly open at night.\nThe plant's wild habitat includes rocky prairies, open woodlands, slopes, roadsides, meadows and disturbed areas. While it makes an attractive garden plant, care should be taken with it as it can become invasive, spreading by runners and seeds. This drought-resistant plant prefers loose, fast-draining soil and full sun.\nThis plant is also frequently referred to as a buttercup, though it is not a true buttercup (genus Ranunculus), or even in the buttercup family Ranunculaceae."
    },
    "2": {
        "common_name": "Hard-leaved Pocket Orchid",
        "genus": "Paphiopedilum",
        "species": "micranthum",
        "wiki_info": "Paphiopedilum micranthum, described in 1951, is commonly known as the Silver Slipper Orchid or Hard-leaved Pocket Orchid. It blooms during late winter to early summer with one flower per inflorescence. Flowers are fragrant\n\n"
    },
    "3": {
        "common_name": "Canterbury Bells",
        "genus": "Campanula",
        "species": "medium",
        "wiki_info": "Campanula medium, common name Canterbury bells, also known as the bell flower, is an annual or biennial flowering plant of the genus Campanula, belonging to the family Campanulaceae. In floriography, it represents gratitude, or faith and constancy."
    },
    "4": {
        "common_name": "Sweet Pea",
        "genus": "Lathyrus",
        "species": "odoratus",
        "wiki_info": "Sweet pea (Lathyrus odoratus) is a flowering plant in the genus Lathyrus in the family Fabaceae (legumes), native to Sicily, southern Italy and the Aegean Islands.\nIt is an annual climbing plant, growing to a height of 1–2 meters (between 39 and 78 inches), where suitable support is available. The leaves are pinnate with two leaflets and a terminal tendril, which twines around supporting plants and structures helping the sweet pea to climb. The flowers are purple, 2–3.5 centimeters broad, in the wild plant, larger and very variable in color in the many cultivars.\nThe annual species, L. odoratus, may be confused with the everlasting pea, L. latifolius, a perennial."
    },
    "5": {
        "common_name": "English Marigold",
        "genus": "Calendula",
        "species": "officinalis",
        "wiki_info": "Calendula officinalis (pot marigold, ruddles, common marigold, garden marigold, English marigold, or Scottish marigold) is a plant in the genus Calendula of the family Asteraceae. It is probably native to southern Europe, though its long history of cultivation makes its precise origin unknown, and it may possibly be of garden origin. It is also widely naturalised further north in Europe (north to southern England) and elsewhere in warm temperate regions of the world."
    },
    "6": {
        "common_name": "Tiger Lily",
        "genus": "Lilium",
        "species": "columbianum",
        "wiki_info": "Lilium columbianum is a lily native to western North America. It is also known as the Columbia lily or tiger lily (sharing the latter common name with several other lily species in its genus).\n\n"
    },
    "7": {
        "common_name": "Moon Orchid",
        "genus": "Phalaenopsis",
        "species": "aphrodite",
        "wiki_info": "Phalaenopsis aphrodite is a species of orchid found from southeastern Taiwan to the Philippines.\n\n"
    },
    "8": {
        "common_name": "Bird of Paradise",
        "genus": "Strellitzia",
        "species": "",
        "wiki_info": "Strelitzia /strɛˈlɪtsiə/ is a genus of five species of perennial plants, native to South Africa. It belongs to the plant family Strelitziaceae. The genus is named after the duchy of Mecklenburg-Strelitz, birthplace of Queen Charlotte of the United Kingdom. A common name of the genus is bird of paradise flower / plant, because of a resemblance of its flowers to the bird of paradise. In South Africa it is commonly known as a crane flower and is featured on the reverse of the 50 cent coin. It is the Official Flower of the City of Los Angeles; two of the species, Strelitzia nicolai and Strelitzia reginae, are frequently grown as house plants. \n\nThe species S. nicolai is the largest in the genus, reaching 10 m tall, with stately white and blue flowers; the other species typically reach 2 to 3.5 m tall, except S. caudata which is a tree of a typically smaller size than S. nicolai. The leaves are large, 30–200 cm long and 10–80 cm broad, similar to a banana leaf in appearance but with a longer petiole, and arranged strictly in two ranks to form a fan-like crown of evergreen foliage. The flowers are produced in a horizontal inflorescence emerging from a stout spathe. They are pollinated by sunbirds, which use the spathe as a perch when visiting the flowers. The weight of the bird when standing on the spathe opens it to release the pollen onto the bird's feet, which is then deposited on the next flower it visits.\nStrelitzia lack natural insect pollinators; in areas without sunbirds, plants in this genus generally need hand pollination in order to successfully set seed."
    },
    "9": {
        "common_name": "Monkshood",
        "genus": "Aconitum",
        "species": "",
        "wiki_info": "Aconitum (/ˌækəˈnaɪtəm/), also known as aconite, monkshood, wolf's bane, leopard's bane, mousebane, women's bane, devil's helmet, Queen of all Poisons, or blue rocket, is a genus of over 250 species of flowering plants belonging to the family Ranunculaceae. These herbaceous perennial plants are chiefly native to the mountainous parts of the northern hemisphere, growing in the moisture-retentive but well-draining soils of mountain meadows. Most species are extremely poisonous  and must be dealt with carefully.\nThe name comes from the Greek ἀκόνιτον, which may derive from the Greek akon for dart or javelin, the tips of which were poisoned with the substance, or from akonae, because of the rocky ground on which the plant was thought to grow. The name may reflect that toxins extracted from the plant were historically used to kill wolves, hence the name wolf's bane. In Metamorphoses, Ovid tells how the herb comes from the slavering mouth of Cerberus, the three-headed dog that guarded the gates of Hell. As the veterinary historian John Blaisdell has noted, symptoms of aconite poisoning in humans bear some passing similarity to those of rabies: frothy saliva, impaired vision, vertigo, and finally a coma. Thus, it is possible that some ancient Greeks would have believed that this poison, mythically born of Cerberus's lips, was literally the same as that to be found inside the mouth of a rabid dog."
    },
    "10": {
        "common_name": "Globe Thistle",
        "genus": "Echinops",
        "species": "sphaerocephalus",
        "wiki_info": "Echinops sphaerocephalus, known by the common names glandular globe-thistle, great globe-thistle or pale globe-thistle, is a species of globe-thistle belonging to the family Asteraceae."
    },
    "11": {
        "common_name": "Snapdragon",
        "genus": "Antirrhinum",
        "species": "",
        "wiki_info": "Antirrhinums are a genus of plants commonly known as dragon flowers or snapdragons because of the flowers' fancied resemblance to the face of a dragon that opens and closes its mouth when laterally squeezed. They are native to rocky areas of Europe, the United States, and North Africa."
    },
    "12": {
        "common_name": "Colt's Foot",
        "genus": "Tussilago",
        "species": "farfara",
        "wiki_info": "Tussilago farfara, commonly known as coltsfoot, is a plant in the groundsel tribe within the sunflower family. It has traditionally had medicinal uses. However, the discovery of toxic pyrrolizidine alkaloids in the plant has resulted in liver health concerns. The name \"tussilago\" is derived from the Latin tussis, meaning cough, and ago, meaning to cast or to act on.\nTussilago farfara is the only accepted species in its genus, although more than two dozen other species have at one time or another been considered part of this group. Most of them are now regarded as members of other genera (Chaptalia, Chevreulia, Farfugium, Homogyne, Leibnitzia, Petasites, Senecio)."
    },
    "13": {
        "common_name": "King Protea",
        "genus": "Protea",
        "species": "cynaroides",
        "wiki_info": "The king protea (Protea cynaroides) is a flowering plant. It is a distinctive member of Protea, having the largest flower head in the genus. The species is also known as giant protea, honeypot or king sugar bush. It is widely distributed in the southwestern and southern parts of South Africa in the fynbos region.\nThe king protea is the national flower of South Africa. It also is the flagship of the The Protea Atlas Project, run by the South African National Botanical Institute.\nThe king protea has several colour forms and horticulturists have recognized 81 garden varieties, some of which have injudiciously been planted in its natural range. In some varieties the pink of the flower and red borders of leaves are replaced by a creamy yellow. This unusual flower has a long vase life in flower arrangements, and makes for an excellent dried flower.\nProtea cynaroides is adapted to survive wildfires by its thick underground stem, which contains many dormant buds; these will produce the new growth after the fire."
    },
    "14": {
        "common_name": "Spear Thistle",
        "genus": "Cirsium",
        "species": "vulgare",
        "wiki_info": "Cirsium vulgare (spear thistle) is a species of the genus Cirsium, native throughout most of Europe (north to 66°N, locally 68°N), Western Asia (east to the Yenisei Valley), and northwestern Africa (Atlas Mountains). It is also naturalised in North America and Australia and is as an invasive weed in some areas. It is the national flower of Scotland.\n^ Interactive Flora of NW Europe: Cirsium vulgare\n^ Flora Europaea: Cirsium vulgare\n^ Den Virtuella Floran: Cirsium vulgare (in Swedish, with maps)"
    },
    "15": {
        "common_name": "Yellow Iris",
        "genus": "Iris",
        "species": "pseudacorus",
        "wiki_info": "Iris pseudacorus (yellow flag, yellow iris, water flag) is a species in the genus Iris, of the family Iridaceae. It is native to Europe, western Asia and northwest Africa. Its specific epithet, meaning \"false acorus,\" refers to the similarity of its leaves to those of Acorus calamus, as they have a prominently veined mid-rib and sword-like shape."
    },
    "16": {
        "common_name": "Globe-Flower",
        "genus": "Trollius",
        "species": "europaeus",
        "wiki_info": "Trollius europaeus (globeflower) is a perennial plant of the family Ranunculaceae. The plant is native to Europe and Western Asia and is a protected species in Bulgaria."
    },
    "17": {
        "common_name": "Purple Coneflower",
        "genus": "Echinacea",
        "species": "purpurea",
        "wiki_info": "Echinacea purpurea (eastern purple coneflower or purple coneflower) is a species of flowering plant in the genus Echinacea of the family Asteraceae. Its cone-shaped flowering heads are usually, but not always, purple in the wild. It is native to eastern North America and present to some extent in the wild in much of the eastern, southeastern and midwest United States."
    },
    "18": {
        "common_name": "Peruvian Lily",
        "genus": "Alstroemeria",
        "species": "",
        "wiki_info": "Alstroemeria (/ˌælstrɨˈmɪəriə/), commonly called the Peruvian lily or lily of the Incas, is a genus of flowering plants in the family Alstroemeriaceae. They are all native to South America although some have become naturalized in the United States, Mexico, Australia, New Zealand, Madeira and the Canary Islands. Almost all of the species are restricted to one of two distinct centers of diversity, one in central Chile, the other in eastern Brazil. Species of Alstroemeria from Chile are winter-growing plants while those of Brazil are summer-growing. All are long-lived perennials except A. graminea, a diminutive annual from the Atacama Desert of Chile.\n^ \n^ Sunset Western Garden Book 1995. 606–607.\n^ Sanso, A. M. and C. C. Xifreda. (2001). Generic delimitation between Alstroemeria and Bomarea (Alstroemeriaceae). Annals of Botany 88(6) 1057-69.\n^ Chacón, J., M. Camargo de Assis, A. W. Meerow, and S. S. Renner. 2012. From east Gondwana to Central America: Historical biogeography of the Alstroemeriaceae. Journal of Biogeography 39(10): 1806-1818. [1]"
    },
    "19": {
        "common_name": "Balloon Flower",
        "genus": "Platycodon",
        "species": "grandiflorus",
        "wiki_info": "Platycodon grandiflorus (from Greek \"πλατυκώδων\", meaning a broad bell) is a species of herbaceous flowering perennial plant of the family Campanulaceae, and the only member of the genus Platycodon. It is native to East Asia (China, Korea, Japan and East Siberia). This species is known as platycodon. Depending upon the region, it is also referred to as the Korean bellflower, Chinese bellflower, Japanese bellflower, common balloon flower, or balloon flower (referring to the balloon-shaped flower buds)."
    },
    "20": {
        "common_name": "Giant White Arum Lily",
        "genus": "Zantedeschia",
        "species": "aethiopica",
        "wiki_info": "Zantedeschia aethiopica (known as calla lily and arum lily) is a species in the family Araceae, native to southern Africa in Lesotho, South Africa, and Swaziland."
    },
    "21": {
        "common_name": "Fire Lily (Glory Lily)",
        "genus": "Gloriosa",
        "species": "superba",
        "wiki_info": "Gloriosa superba is a species of flowering plant in the family Colchicaceae. English language common names include flame lily, climbing lily, creeping lily, glory lily, gloriosa lily, tiger claw, and fire lily. Names in other languages include kalihari (Hindi), Kaanthal (Tamil), ulotchondal (Bengali), lis de Malabar (French), aranha de emposse (Portuguese), bandera española [Spanish flag] (Spanish), mkalamu (Swahili), klänglilja (Swedish), riri (Māori), and jia lan (Chinese). It is native to much of Africa and Asia, but it is known worldwide as an ornamental plant, a medicine, a poison, and a noxious weed.\n^ a b c Gloriosa superba. Germplasm Resources Information Network.\n^ Scheper, J. Gloriosa superba. Floridata.com.\n^ a b Gloriosa superba. Pacific Island Ecosystems at Risk (PIER).\n^ Oudhia, P. (2002). Gloriosa superba. New Crop Resource Online Program. Center for New Crops & Plant Products. Purdue University.\n^ Dounias, E. Gloriosa superba L. Protabase Record Display. Plant Resources of Tropical Africa (PROTA)."
    },
    "22": {
        "common_name": "Pincushion Flower",
        "genus": "Scabiosa",
        "species": "",
        "wiki_info": "Scabiosa /skeɪbiˈoʊsə/ is a genus in the honeysuckle family (Caprifoliaceae) of flowering plants. Many of the species in this genus have common names that include the word scabious; however some plants commonly known as scabious are currently classified in related genera such as Knautia and Succisa; at least some of these were formerly placed in Scabiosa. Another common name for members of this genus is pincushion flowers."
    },
    "23": {
        "common_name": "Fritillary",
        "genus": "Fritillaria",
        "species": "",
        "wiki_info": "Fritillaria is a genus of Eurasian, North African, and North American plants in the lily family.\nThere are about 100 to 130 species of bulbous plants in the family Liliaceae, native to temperate regions of the Northern Hemisphere, especially the Mediterranean, southwest Asia, and western North America. The name is derived from the Latin term for a dice-box (fritillus), and probably refers to the checkered pattern of the flowers of many species. Plants of the genus are known in English as fritillaries. Some North American species are called mission bells."
    },
    "24": {
        "common_name": "Red Ginger",
        "genus": "Alpinia",
        "species": "purpurata",
        "wiki_info": "Alpinia purpurata, red ginger, also called ostrich plume and pink cone ginger, are native Malaysian plants with showy flowers on long brightly colored red bracts. They look like the bloom, but the true flower is the small white flower on top.\nIt has cultivars called Jungle King and Jungle Queen. Red Ginger grows in Hawaii, Trinidad, Grenada, St. Lucia, Dominica, St. Vincent, Martinique, Guadeloupe, Puerto Rico, Suriname (where its Dutch name is 'bokkepoot', billy-goat's foot), and many Central American nations, including Belize. It is also found in Samoa, where it is the national flower, and is locally called \"teuila.\"\nRed ginger can also be grown in South Florida since, in general, the region does not fall below freezing temperatures. It prefers partial shade and moist humid conditions, although it can tolerate full sun in some climates. It tends to like to be well watered and not left to dry out.\nGinger can also be grown as a houseplant and its cut flowers can be used in arrangements.\nGinger tends to spread."
    },
    "25": {
        "common_name": "Grape Hyacinth",
        "genus": "Muscari",
        "species": "",
        "wiki_info": "Muscari is a genus of perennial bulbous plants native to Eurasia that produce spikes of dense, most commonly blue, urn-shaped flowers resembling bunches of grapes in the spring. The common name for the genus is grape hyacinth (a name which is also used for the related genera Leopoldia and Pseudomuscari, which were formerly included in Muscari). Other common names are baby's breath and bluebell, although these are also used for other plants, particularly Gypsophila and Hyacinthoides respectively. A number of species of Muscari are used as ornamental garden plants."
    },
    "26": {
        "common_name": "Corn Poppy",
        "genus": "Papaver",
        "species": "rhoeas",
        "wiki_info": "Papaver rhoeas (common names include common poppy, corn poppy, corn rose, field poppy, Flanders poppy, red poppy, red weed, coquelicot, and, due to its odour, which is said to cause them, as headache and headwark) is a herbaceous species of flowering plant in the poppy family, Papaveraceae. This poppy is notable as an agricultural weed (hence the common names including \"corn\" and \"field\") and after World War I as a symbol of dead soldiers.\nBefore the advent of herbicides, P. rhoeas sometimes was so abundant in agricultural fields that it could be mistaken for a crop. However the only species of Papaveraceae grown as a field crop on a large scale is Papaver somniferum, the opium poppy."
    },
    "27": {
        "common_name": "Prince of Wales' Feathers",
        "genus": "Amaranth",
        "species": "",
        "wiki_info": "Amaranthus, collectively known as amaranth, is a cosmopolitan genus of annual or short-lived perennial plants. Some amaranth species are cultivated as leaf vegetables, cereals, and ornamental plants. Most of the species from Amaranthus are summer annual weeds and are commonly referred to as pigweed. Catkin-like cymes of densely packed flowers grow in summer or autumn. Approximately 60 species are recognized, with inflorescences and foliage ranging from purple and red to green or gold. Members of this genus share many characteristics and uses with members of the closely related genus Celosia.\n\"Amaranth\" derives from Greek ἀμάραντος (amarantos), \"unfading,\" with the Greek word for \"flower,\" ἄνθος (anthos), factoring into the word's development as \"amaranth.\" The more accurate \"amarant\" is an archaic variant.\n^ Bensch et al. (2003). Interference of redroot pigweed (Amaranthus retroflexus), Palmer amaranth (A. palmeri), and common waterhemp (A. rudis) in soybean. Weed Science 51: 37-43.\n^ RHS A-Z encyclopedia of garden plants. United Kingdom: Dorling Kindersley. 2008. p. 1136. ISBN 1405332964. \n^ Liddell & Scott, A Greek-English Lexicon, s.v. ἀμάραντος"
    },
    "28": {
        "common_name": "Stemless Gentian",
        "genus": "Gentiana",
        "species": "acaulis",
        "wiki_info": "Gentiana acaulis (stemless gentian) is a species of flowering plant in the family Gentianaceae, native to central and southern Europe, from Spain east to the Balkans, growing especially in mountainous regions, such as the Alps, Cevennes and Pyrenees, at heights of 800–3,000 m (2,625–9,843 ft).\n\nIt is a perennial plant, growing to 2 cm tall and 10 cm or more wide. The leaves are evergreen, 2-3.5 cm long, in a basal rosette, forming clumps. The trumpet-shaped terminal flowers are blue with olive-green spotted longitudinal throats. They grow on a very short peduncle, 3–6 cm long. The flower stem is often without leaves, or has 1 or 2 pairs of leaves. It likes full sun, is fully hardy and flowers in late spring and summer.\nThis plant, like others of its genus, is valued in cultivation for the unusually pure intense blue of its blooms. It has gained the Royal Horticultural Society's Award of Garden Merit.\nThe Latin specific epithet acaulis means \"short-stemmed\".\nThe closely related Gentiana clusii, often called by the same common name as this species, differs by growing on limy soils. It also has shorter leaves and the flowers have no olive-green stripes.\nA depiction of a gentian flower can be seen on the obverse side of Austrian € 0.01 euro coins."
    },
    "29": {
        "common_name": "Artichoke",
        "genus": "Cynara",
        "species": "cardunculus",
        "wiki_info": "The cardoon (Cynara cardunculus), also called the artichoke thistle, cardone, cardoni, carduni or cardi, is a thistle-like plant in the family Asteraceae. It is a naturally occurring species that is sometimes considered to include the globe artichoke, and has many cultivated forms. It is native to the western and central Mediterranean region, where it was domesticated in ancient times."
    },
    "30": {
        "common_name": "Sweet William",
        "genus": "Dianthus",
        "species": "barbatus",
        "wiki_info": "Dianthus barbatus (Sweet William)  is a species of Dianthus native to southern Europe and parts of Asia which has become a popular ornamental garden plant. It is a herbaceous biennial or short-lived perennial plant growing to 30–75 cm tall, with flowers in a dense cluster of up to 30 at the top of the stems. Each flower is 2–3 cm diameter with five petals displaying serrated edges. Wild plants produce red flowers with a white base, but colours in cultivars range from white, pink, red, and purple to variegated patterns. The exact origin of its English common name is unknown but first appears in 1596 in botanist John Gerard's garden catalog. The flowers are edible and may have medicinal properties. Sweet William attracts bees, birds, and butterflies.\n^ \"The Plant List: A Working List of All Plant Species\". Retrieved 19 April 2015. \n^ Thompson and Morgan plant catalog spelling - Sweet William"
    },
    "31": {
        "common_name": "Carnation",
        "genus": "Dianthus",
        "species": "caryophyllus",
        "wiki_info": "Dianthus caryophyllus, carnation or clove pink, is a species of Dianthus. It is probably native to the Mediterranean region but its exact range is unknown due to extensive cultivation for the last 2,000 years.\nIt is a herbaceous perennial plant growing to 80 cm tall. The leaves are glaucous greyish green to blue-green, slender, up to 15 cm long. The flowers are produced singly or up to five together in a cyme; they are 3–5 cm diameter, and sweetly scented; the original natural flower colour is bright pinkish-purple, but cultivars of other colours, including red, white, yellow and green, have been developed.\nSome fragrance-less carnation cultivars are often used as boutonnieres for men.\n^ Med-Checklist: Dianthus caryophyllus\n^ Flora Europaea: Dianthus caryophyllus\n^ Blamey, M. & Grey-Wilson, C. (1989). Flora of Britain and Northern Europe. ISBN 0-340-40170-2\n^ a b Huxley, A., ed. (1992). New RHS Dictionary of Gardening. Macmillan ISBN 0-333-47494-5.\n^ Flora of NW Europe: Dianthus caryophyllus"
    },
    "32": {
        "common_name": "Garden Phlox",
        "genus": "Phlox",
        "species": "paniculata",
        "wiki_info": "Phlox paniculata (Fall phlox, Garden phlox or Perennial phlox) is a species of flowering plant in the family Polemoniaceae, native to the eastern United States, but extensively cultivated as an ornamental plant.\n^ Phlox paniculata L. USDA"
    },
    "33": {
        "common_name": "Love in the Mist",
        "genus": "Nigella",
        "species": "damascena",
        "wiki_info": "Nigella damascena (love-in-a-mist, ragged lady) is an annual garden flowering plant, belonging to the buttercup family Ranunculaceae. It is native to southern Europe (but adventive in more northern countries of Europe), north Africa and southwest Asia, where it is found on neglected, damp patches of land.\nThe specific epithet damascena relates to Damascus in Syria. The plant's common name comes from the flower being nestled in a ring of multifid, lacy bracts. It is also sometimes called devil-in-the-bush.\nIt grows to 20–50 cm (8–20 in) tall, with pinnately divided, thread-like, alternate leaves. The flowers, blooming in early summer, are most commonly different shades of blue, but can be white, pink, or pale purple, with 5 to 25 sepals. The actual petals are located at the base of the stamens and are minute and clawed. The sepals are the only colored part of the perianth. The four to five carpels of the compound pistil have each an erect style.\nThe fruit is a large and inflated capsule, growing from a compound ovary, and is composed of several united follicles, each containing numerous seeds. This is rather exceptional for a member of the buttercup family. The capsule becomes brown in late summer. The plant self-seeds, growing on the same spot year after year."
    },
    "34": {
        "common_name": "Mexican Aster",
        "genus": "Cosmos",
        "species": "bipinnatus",
        "wiki_info": "Cosmos bipinnatus, commonly called the garden cosmos or Mexican aster, is a medium-sized flowering herbaceous plant native to Mexico. The species and its varieties and cultivars are popular as an ornamental plant in temperate climate gardens. It can also be found in natural areas in much of North America, where it is a garden escape (introduced species) and in some habitats becoming a weed."
    },
    "35": {
        "common_name": "Alpine Sea Holly",
        "genus": "Eryngium",
        "species": "alpinum",
        "wiki_info": "Eryngium alpinum (alpine sea holly, alpine eryngo or queen of the Alps) is a perennial herb in the family Apiaceae."
    },
    "36": {
        "common_name": "Ruby-lipped Cattleya",
        "genus": "Cattleya",
        "species": "labiata",
        "wiki_info": "Cattleya labiata, also known as the Crimson Cattleya or Ruby-lipped Cattleya, is the type species of Cattleya, discovered in 1818 in Brazil.\nThis plant grows in the northeastern area of Brazil, in the states of Pernambuco and Alagoas. They grow to different sizes depending on the area from which they originate. Those that are growing in Pernambuco are smaller, with small but colored flowers, with most of them being lilac. The interior part of the flower is a dark lilac color. Plants from Alagoas are bigger and have larger flowers. Some varieties, such as Cattleya labiata var. semialba, have large white flowers with a touch of yellow. There is another variety of semialba, with lilac in the inferior part of the flower. This plant is an epiphyte, growing up in trees, where light is plentiful. However, there are also many other places where this plant could grow, such as directly on rock with very little soil.\nThe plant itself is a medium sized unifoliate (labiate) Cattleya, with a medium sized rhizome. The plant has long leaves, with a tough (coriaceous) consistency because of the aridity in the canopy of trees, due to a short dry season. For water requirements, the plant has a pseudobulb under every leaf to store water and nutritive substances during the short dry season. In the wet season new leaves grow rapidly, producing a large flowered inflorescence. Flowers are white or lavender colored with a darker spot in the lip. Pollination is performed by insects, usually by a scent-collecting male euglosine bee. The result is a capsule with a very large number of seeds (10,000-20,000).\nThe diploid chromosome number of C. labiata has been variously determined as 2n = 40, 41, and 46. The haploid chromosome number of C. labiata has been variously determined as n = 21 and 21."
    },
    "37": {
        "common_name": "Cape Flower",
        "genus": "Nerine",
        "species": "bowdenii",
        "wiki_info": "Nerine bowdenii is a species of flowering plant in the family Amaryllidaceae. It is an herbaceous bulbous perennial, growing to 45 cm (18 in) tall by 8 cm (3 in), with strap-shaped leaves and large umbels of lily-like pink flowers in late summer and autumn. The common names of the species are Cornish lily, Cape flower and Guernsey lily. However, it is neither a true lily nor from the Cornwall or Guernsey, but originates from South Africa (Eastern Cape, KwaZulu/Natal, Free State, Drakensberg Mountains).\nThe species was named in 1904 after Athelstan Hall Cornish-Bowden (1871–1942), who had sent bulbs of the plant to England from South Africa.\n\n"
    },
    "38": {
        "common_name": "Great Masterwort",
        "genus": "Astrantia",
        "species": "major",
        "wiki_info": "Astrantia major, common name great masterwort, is a species of flowering plant in the family Apiaceae, native to central and eastern Europe. Growing to 90 cm (35 in) tall by 45 cm (18 in) broad, it is an herbaceous perennial, much used in gardens."
    },
    "39": {
        "common_name": "Siam Tulip",
        "genus": "Curcuma",
        "species": "alismatifolia",
        "wiki_info": "Curcuma alismatifolia, Siam tulip or summer tulip (Thai: ปทุมา, pathuma, or ดอกกระเจียว, dok krajiao) is a tropical plant native to Laos, northern Thailand and Cambodia. Despite its name, it is not related to the tulip, but to the various ginger species such as turmeric. It can grow as an indoor plant, and is also sold as cut flowers.\nOne of the most famous wild fields of Siam Tulips is in Pa Hin Ngam National Park in the Chaiyaphum province of Thailand.\nMalvidin 3-rutinoside is a pigment responsible for bract color in C. alismatifolia.\n\n"
    },
    "40": {
        "common_name": "Lenten Rose",
        "genus": "Helleborus",
        "species": "orientalis",
        "wiki_info": "Helleborus orientalis, commonly called green hellebore, is an perennial flowering plant in the buttercup family Ranunculaceae native to Greece and Turkey. It was described by Jean-Baptiste Lamarck in 1789."
    },
    "41": {
        "common_name": "Barbeton Daisy",
        "genus": "Gerbera",
        "species": "Jamesonii",
        "wiki_info": "Gerbera jamesonii is a species of flowering plant in the genus Gerbera. It is indigenous to South Eastern Africa and commonly known as the Barberton daisy, the Transvaal daisy, and as Barbertonse madeliefie in Afrikaans."
    },
    "42": {
        "common_name": "Daffodil",
        "genus": "Narcissus",
        "species": "",
        "wiki_info": "Narcissus /nɑrˈsɪsəs/ is a genus of predominantly spring perennial plants in the Amaryllidaceae (amaryllis) family. Various common names including daffodil, daffadowndilly, narcissus, and jonquil are used to describe all or some members of the genus. Narcissus has conspicuous flowers with six petal-like tepals surmounted by a cup- or trumpet-shaped corona. The flowers are generally white or yellow (orange or pink in garden varieties), with either uniform or contrasting coloured tepals and corona.\nNarcissus were well known in ancient civilisation, both medicinally and botanically, but formally described by Linnaeus' in his Species Plantarum (1753). The genus is generally considered to have about ten sections with approximately 50 species. The number of species has varied, depending on how they are classified, due to similarity between species and hybridization. The genus arose some time in the Late Oligocene to Early Miocene epochs, in the Iberian peninsula and adjacent areas of southwest Europe. The exact origin of the name Narcissus is unknown, but it is often linked to a Greek word for intoxicated (narcotic) and the myth of the youth of that name who fell in love with his own reflection. The English word 'daffodil' appears to be derived from \"asphodel\", with which it was commonly compared.\nThe species are native to meadows and woods in southwest Europe and North Africa with a center of diversity in the Western Mediterranean, particularly the Iberian peninsula. Both wild and cultivated plants have naturalised widely, and were introduced into the Far East prior to the tenth century. Narcissi tend to be long-lived bulbs, which propagate by division, but are also insect-pollinated. Known pests, diseases and disorders include viruses, fungi, the larvae of flies, mites and nematodes. Some Narcissus species have become extinct, while others are threatened by increasing urbanisation and tourism.\nHistorical accounts suggest narcissi have been cultivated from the earliest times, but became increasingly popular in Europe after the 16th century and by the late 19th century were an important commercial crop centred primarily on the Netherlands. Today narcissi are popular as cut flowers and as ornamental plants in private and public gardens. The long history of breeding has resulted in thousands of different cultivars. For horticultural purposes, narcissi are classified into divisions, covering a wide range of shapes and colours. Like other members of their family, narcissi produce a number of different alkaloids, which provide some protection for the plant, but may be poisonous if accidentally ingested. This property has been exploited for medicinal use in traditional healing and has resulted in the production of galantamine for the treatment of Alzheimer's dementia. Long celebrated in art and literature, narcissi are associated with a number of themes in different cultures, ranging from death to good fortune, and as symbols of Spring. The daffodil is the national flower of Wales and the symbol of cancer charities in many countries. The appearance of the wild flowers in spring is associated with festivals in many places.\n^ \n^ Thomé 1903, p. 316."
    },
    "43": {
        "common_name": "Sword Lily",
        "genus": "Gladiolus",
        "species": "",
        "wiki_info": "Gladiolus (from Latin, the diminutive of gladius, a sword) is a genus of perennial bulbous flowering plants in the iris family (Iridaceae). It is sometimes called the 'Sword lily', but usually by its generic name (plural gladioli).\nThe genus occurs in Asia, Mediterranean Europe, South Africa, and tropical Africa. The center of diversity is in the Cape Floristic Region. The genera Acidanthera, Anomalesia, Homoglossum, and Oenostachys, formerly considered distinct, are now included in Gladiolus.\n^ \"Gladiolus\". Royal Botanic Gardens, Kew: World Checklist of Selected Plant Families. Retrieved 10 April 2014. \n^ Manning, John; Goldblatt, Peter (2008). The Iris Family: Natural History & Classification. Portland, Oregon: Timber Press. pp. 138–42. ISBN 0-88192-897-6. \n^ Shorter Oxford English dictionary: 6th edition. United Kingdom: Oxford University Press. 2007. ISBN 0199206872. \n^ Goldblatt, P. &, J.C. Manning. Gladiolus in Southern Africa : Systematics, Biology, and Evolution. Fernwood Press, Cape Town; 1998.\n^ GOLDBLATT P. & DE VOS M. P. The reduction of Oenostachys, Homoglossum and Anomalesia, putative sunbird pollinated genera, in Gladiolus L. (Iridaceae-Ixioideae). Bulletin du Muséum national d'histoire naturelle. Section B, Adansonia 11 (4): 417-428, 1989."
    },
    "44": {
        "common_name": "Poinsettia",
        "genus": "Euphorbia",
        "species": "pulcherrima",
        "wiki_info": "The poinsettia (/pɔɪnˈsɛtiə/ or /pɔɪnˈsɛtə/) (Euphorbia pulcherrima) is a culturally and commercially important plant species of the diverse spurge family that is indigenous to Mexico and Central America. It is particularly well known for its red and green foliage and is widely used in Christmas floral displays. It derives its common English name from Joel Roberts Poinsett, the first United States Minister to Mexico, who introduced the plant into the United States in 1825."
    },
    "45": {
        "common_name": "Bolero Deep Blue",
        "genus": "Eustoma",
        "species": "russellianum",
        "wiki_info": "Eustoma russellianum, is a species of flowering plant in the Gentian family. Its previous binomial name was Eustoma grandiflorum. Common names include Texas bluebells, Texas bluebell, bluebell, showy prairie gentian, prairie gentian The Bolero Deep Blue, and Lisianthus."
    },
    "46": {
        "common_name": "Wallflower",
        "genus": "Erysimum",
        "species": "",
        "wiki_info": "Erysimum (wallflower) is a genus of flowering plants in the botanical family Brassicaceae, that includes about 180 species, both popular garden plants and many wild forms. The genus Cheiranthus is sometimes included here in whole or in part. Erysimum has recently been ascribed to a monogeneric cruciferous tribe, Erysimeae. This tribe is characterized by sessile, stellate and/or malpighiaceous trichomes, yellow to orange flowers and multiseeded siliques."
    },
    "47": {
        "common_name": "Marigold",
        "genus": "Tagetes",
        "species": "",
        "wiki_info": "Tagetes  is a genus of annual or perennial, mostly herbaceous plants in the sunflower family (Asteraceae or Compositae). It was described as a genus by Linnaeus in 1753.\nThe genus is native to North and South America, but some species have become naturalized around the world. One species, T. minuta, is considered a noxious invasive plant in some areas."
    },
    "48": {
        "common_name": "Buttercup",
        "genus": "Ranunculus",
        "species": "",
        "wiki_info": "Ranunculus /ræˈnʌŋkjʊləs/ is a large genus of about 600 species of plants in the Ranunculaceae. Members of the genus include the buttercups, spearworts, water crowfoots and the lesser celandine. The petals are often highly lustrous, especially in yellow species. Buttercups usually flower in the spring, but flowers may be found throughout the summer, especially where the plants are growing as opportunistic colonizers, as in the case of garden weeds.\nThe Water crowfoots (Ranunculus subgenus Batrachium), which grow in still or running water, are sometimes treated in a separate genus Batrachium (from Greek βάτραχος batrachos, \"frog\"). They have two different leaf types, thread-like leaves underwater and broader floating leaves. In some species, such as R. aquatilis, a third, intermediate leaf type occurs.\nRanunculus species are used as food plants by the larvae of some Lepidoptera species including Hebrew Character and Small Angle Shades. Some species are popular ornamental flowers in horticulture, with many cultivars selected for large and brightly coloured flowers."
    },
    "49": {
        "common_name": "Oxeye Daisy",
        "genus": "Leucanthemum",
        "species": "vulgare",
        "wiki_info": "Leucanthemum vulgare, the ox-eye daisy or oxeye daisy, is a widespread flowering plant native to Europe and the temperate regions of Asia and an introduced plant to North America, Australia and New Zealand. It is one of a number of family Asteraceae plants to be called a \"daisy\", and has the vernacular names common daisy, dog daisy, moon daisy and oxe-eye daisy.\nL. vulgare is a typical grassland perennial wildflower, growing in a variety of plant communities including meadows and fields, under scrub and open-canopy forests, and in disturbed areas.\nLeucanthemum is from the Ancient Greek λευκός (leukós, \"white\") and ἄνθος (ánthos, \"flower\").\n^ \"The Plant List: A Working List of All Plant Species\". Retrieved 5 December 2014. \n^ T. Dickinson, D. Metsger, J. Bull & R. Dickinson (2004). ROM Field Guide to Wildflowers of Ontario. Toronto: Royal Ontario Museum. p. 175. \n^ \"BSBI List 2007\". Botanical Society of Britain and Ireland. Archived from the original (XLS) on 2015-02-25. Retrieved 2014-10-17. \n^ \"Ox-Eye Daisy - Chrysanthemum leucanthemum\". cirrusimage.com."
    },
    "50": {
        "common_name": "Common Dandelion",
        "genus": "Taraxacum",
        "species": "officinale",
        "wiki_info": "Taraxacum officinale, the common dandelion (often simply called \"dandelion\"), is a flowering herbaceous perennial plant of the family Asteraceae (Compositae). It can be found growing in temperate regions of the world, in lawns, on roadsides, on disturbed banks and shores of water ways, and other areas with moist soils. T. officinale is considered a weed, especially in lawns and along roadsides, but it is sometimes used as a medical herb and in food preparation. Common dandelion is well known for its yellow flower heads that turn into round balls of silver tufted fruits that disperse in the wind called \"blowballs\" or \"clocks\" (in both British and American English)."
    },
    "51": {
        "common_name": "Petunia",
        "genus": "petunia",
        "species": "",
        "wiki_info": "Petunia is genus of 35 species of  flowering plants of South American origin, closely related to tobacco, cape gooseberries, tomatoes, deadly nightshades, potatoes and chili peppers; in the family Solanaceae. The popular flower of the same name derived its epithet from the French, which took the word petun, meaning \"tobacco,\" from a Tupi–Guarani language. An annual, most of the varieties seen in gardens are hybrids (P. × atkinsiana, also known as P. hybrida).\n^ Maberly, D.J. 1990. The Plant Book. A portable dictionary of the higher plants. Cambridge Univ. Press, Cambridge, U.K."
    },
    "52": {
        "common_name": "Wild Pansy",
        "genus": "Viola",
        "species": "tricolor",
        "wiki_info": "Viola tricolor, known as heartsease, heart's ease, heart's delight, tickle-my-fancy, Jack-jump-up-and-kiss-me, come-and-cuddle-me, three faces in a hood, or love-in-idleness, is a common European wild flower, growing as an annual or short-lived perennial. It has been introduced into North America, where it has spread widely, and is known as the johnny jump up (though this name is also applied to similar species such as the yellow pansy). It is the progenitor of the cultivated pansy, and is therefore sometimes called wild pansy; before the cultivated pansies were developed, \"pansy\" was an alternative name for the wild form.\n\nV. tricolor is a small plant of creeping and ramping habit, reaching at most 15 cm in height, with flowers about 1.5 cm in diameter. It grows in short grassland on farms and wasteland, chiefly on acid or neutral soils. It is usually found in partial shade. It flowers from April to September (in the northern hemisphere). The flowers can be purple, blue, yellow or white. They are hermaphrodite and self-fertile, pollinated by bees.\nAs its name implies, heartsease has a long history of use in herbalism. It has been recommended, among other uses, for epilepsy, asthma, skin diseases and eczema. V. tricolor has a history in folk medicine of helping respiratory problems such as bronchitis, asthma, and cold symptoms. It has expectorant properties, and so has been used in the treatment of chest complaints such as bronchitis and whooping cough. It is also a diuretic, leading to its use in treating rheumatism and cystitis.\nThe flowers have also been used to make yellow, green and blue-green dyes, while the leaves can be used to make a chemical indicator.\nLong before cultivated pansies were released into the trade in 1839, V. tricolor was associated with thought in the \"language of flowers\", often by its alternative name of pansy (from the French \"pensée\" - thought): hence Ophelia's often quoted line in Shakespeare's Hamlet, \"There's pansies, that's for thoughts\". What Shakespeare had in mind was V. tricolor, not a modern garden pansy.\nShakespeare makes a more direct reference, probably to V. tricolor in A Midsummer Night's Dream. Oberon sends Puck to gather \"a little western flower\" that maidens call \"love-in-idleness\". Oberon's account is that he diverted an arrow from Cupid's bow aimed at \"a fair vestal, throned by the west\" (supposedly Queen Elizabeth I) to fall upon the plant \"before milk-white, now purple with love's wound\". The \"imperial vot'ress\" passes on \"fancy-free\", destined never to fall in love. The juice of the heartsease now, claims Oberon, \"on sleeping eyelids laid, Will make or man or woman madly dote Upon the next live creature that it sees.\" Equipped with such powers, Oberon and Puck control the fates of various characters in the play to provide Shakespeare's essential dramatic and comic structure for the play."
    },
    "53": {
        "common_name": "Primula",
        "genus": "Primula",
        "species": "",
        "wiki_info": "Primula /ˈprɪmjʊlə/ is a genus of mainly herbaceous flowering plants in the family Primulaceae. They include the familiar wildflower of banks and verges, the primrose (P. vulgaris). Other common species are P. auricula (auricula), P. veris (cowslip) and P. elatior (oxlip). These species and many others are valued for their ornamental flowers. They have been extensively cultivated and hybridised - in the case of the primrose, for many hundreds of years. Primula are native to the temperate northern hemisphere, south into tropical mountains in Ethiopia, Indonesia and New Guinea, and in temperate southern South America. Almost half of the known species are from the Himalayas.\nPrimula has about 500 species in traditional treatments, and more if certain related genera are included within its circumscription."
    },
    "54": {
        "common_name": "Sunflower",
        "genus": "Helianthus",
        "species": "annuus",
        "wiki_info": "Helianthus annuus, the common sunflower, is an annual species of sunflower grown as a crop for its edible oil and edible fruits (sunflower seeds). This sunflower species is also used as bird food, as livestock forage (as a meal or a silage plant), and in some industrial applications. The plant was first domesticated in the Americas. Wild Helianthus annuus is a widely branched annual plant with many flower heads. The domestic sunflower, however, often possesses only a single large inflorescence (flower head) atop an unbranched stem. The name sunflower may derive from the flower's head's shape, which resembles the sun, or from the false impression that the blooming plant appears to slowly turn its flower towards the sun as the latter moves across the sky on a daily basis.\nSunflower seeds were brought to Europe from the Americas in the 16th century, where, along with sunflower oil, they became a widespread cooking ingredient."
    },
    "55": {
        "common_name": "Pelargonium",
        "genus": "Pelargonium",
        "species": "",
        "wiki_info": "Pelargonium /ˌpɛlɑrˈɡoʊniəm/ is a genus of flowering plants which includes about 200 species of perennials, succulents, and shrubs, commonly known as geraniums (in the United States also storksbills). Confusingly, Geranium is the correct botanical name of a separate genus of related plants often called cranesbills or hardy geraniums. Both genera belong to the family Geraniaceae. The confusion stems from Linnaeus originally including all the species in one genus, Geranium, but their later being separated into two genera by Charles L’Héritier in 1789.\nPelargonium species are evergreen perennials indigenous to Southern Africa, and are drought and heat tolerant, but can tolerate only minor frosts. Some species are extremely popular garden plants, grown as bedding plants in temperate regions."
    },
    "56": {
        "common_name": "Bishop of Llandaff",
        "genus": "Dahlia",
        "species": "hortensis",
        "wiki_info": "Dahlia 'Bishop of Llandaff' is a branching, tuberous tender perennial cultivar with dark eggplant-colored, almost black, foliage. This produces a stunning contrast with its scarlet flowers. The plant was first bred by Fred Tresedar, a Cardiff nurseryman. It was selected by and named to honour Pritchard Hughes, Bishop of Llandaff, in 1924 and won the RHS Award of Garden Merit in 1928. The plant is about 1 m tall and flowers from June until September. As with all dahlias, frost blackens its foliage, and its tubers need to be overwintered in a dry, frost-free place.\nA seed strain has been produced from this plant called 'Bishops Children', they retain the dark foliage color but produce a mix of flower colors and flower shapes from single to semi-double flowers in different sizes.\nPlant Profile:- Height:1.1m (3&1/2 ft) Spread: 45 cm (18 in) site: Full Sun Soil: Fertile, free-draining Hardiness: Half hardy\nAlso comes in rich reds & purples, yellows & oranges, as well as paler shades\n"
    },
    "57": {
        "common_name": "Gaura",
        "genus": "Gaura",
        "species": "",
        "wiki_info": "Gaura is a genus of flowering plants in the family Onagraceae, native to North America. The genus includes many species known commonly as beeblossoms. Recent genetic research has shown that the genus is paraphyletic unless the monotypic genus Stenosiphon is included within Gaura, increasing the number of species in the genus to 22.\nThey are annual, biennial or perennial herbaceous plants; most are perennials with sturdy rhizomes, often forming dense thickets, crowding or shading out other plant species. They have a basal rosette of leaves, with erect or spreading flowering stems up to 2 m (rarely more) tall, leafy on the lower stem, branched and leafless on the upper stem. The flowers have four (rarely three) petals; they are zygomorphic, with all the petals directed somewhat upwards. The fruit is an indehiscent nut-like body containing reddish-brown seeds. It reproduces via seeds and also by rhizome growth.\nSpecies\nSeveral species of Gaura are regarded as noxious weeds, especially in disturbed or overgrazed areas where it easily takes hold. They can become a nuisance in situations involving disturbed habitat, such as trampled rangeland and clearings. Efforts to control Gaura focus mainly on prevention of misuse of land. There is no biological control method for plants of genus Gaura, and removing existing infestations is difficult, due in large part to the plants' ability to reproduce from bits of rhizome left in the ground.\nDespite the poor reputation of plants of this genus, some species are cultivated as garden plants, such as G. lindheimeri (White Gaura)."
    },
    "58": {
        "common_name": "Geranium",
        "genus": "Geranium",
        "species": "",
        "wiki_info": "Geranium is a genus of 422 species of flowering annual, biennial, and perennial plants that are commonly known as the cranesbills. They are found throughout the temperate regions of the world and the mountains of the tropics, but mostly in the eastern part of the Mediterranean region. The long, palmately cleft leaves are broadly circular in form. The flowers have five petals and are coloured white, pink, purple or blue, often with distinctive veining. Geraniums will grow in any soil as long as it is not waterlogged. Propagation is by semiripe cuttings in summer, by seed, or by division in autumn or spring.\nThe genus name is derived from the Greek γέρανος (géranos) or γερανός (geranós) ‘crane’. The English name ‘cranesbill’ derives from the appearance of the fruit capsule of some of the species. Species in the Geranium genus have a distinctive mechanism for seed dispersal. This consists of a beak-like column which springs open when ripe and casts the seeds some distance. The fruit capsule consists of five cells, each containing one seed, joined to a column produced from the centre of the old flower. The common name ‘cranesbill’ comes from the shape of the unsprung column, which in some species is long and looks like the bill of a crane. However, many species in this genus do not have a long beak-like column.\nGeraniums are eaten by the larvae of some Lepidoptera species including brown-tail and mouse moth.\nThe species Geranium viscosissimum (sticky geranium) is considered to be protocarnivorous."
    },
    "59": {
        "common_name": "Orange Dahlia",
        "genus": "Dahlia",
        "species": "",
        "wiki_info": "Dahlia (UK /deɪliə/ or US /dɑːliə/) is a genus of bushy, tuberous, herbaceous perennial plants native to Mexico. A member of the Asteraceae (or Compositae), dicotyledonous plants, related species include the sunflower, daisy, chrysanthemum, and zinnia. There are 42 species of dahlia, with hybrids commonly grown as garden plants. Flower forms are variable, with one head per stem; these can be as small as 2 in (5.1 cm) diameter or up to 1 ft (30 cm) (\"dinner plate\"). This great variety results from dahlias being octoploids—that is, they have eight sets of homologous chromosomes, whereas most plants have only two. In addition, dahlias also contain many transposons—genetic pieces that move from place to place upon an allele—which contributes to their manifesting such great diversity.\nThe stems are leafy, ranging in height from as low as 12 in (30 cm) to more than 6–8 ft (1.8–2.4 m). The majority of species do not produce scented flowers or cultivars. Like most plants that do not attract pollinating insects through scent, they are brightly colored, displaying most hues, with the exception of blue.\nThe dahlia was declared the national flower of Mexico in 1963. The tubers were grown as a food crop by the Aztecs, but this use largely died out after the Spanish Conquest. Attempts to introduce the tubers as a food crop in Europe were unsuccessful."
    },
    "60": {
        "common_name": "Pink-yellow Dahlia",
        "genus": "Dahlia",
        "species": "",
        "wiki_info": "Dahlia (UK /deɪliə/ or US /dɑːliə/) is a genus of bushy, tuberous, herbaceous perennial plants native to Mexico. A member of the Asteraceae (or Compositae), dicotyledonous plants, related species include the sunflower, daisy, chrysanthemum, and zinnia. There are 42 species of dahlia, with hybrids commonly grown as garden plants. Flower forms are variable, with one head per stem; these can be as small as 2 in (5.1 cm) diameter or up to 1 ft (30 cm) (\"dinner plate\"). This great variety results from dahlias being octoploids—that is, they have eight sets of homologous chromosomes, whereas most plants have only two. In addition, dahlias also contain many transposons—genetic pieces that move from place to place upon an allele—which contributes to their manifesting such great diversity.\nThe stems are leafy, ranging in height from as low as 12 in (30 cm) to more than 6–8 ft (1.8–2.4 m). The majority of species do not produce scented flowers or cultivars. Like most plants that do not attract pollinating insects through scent, they are brightly colored, displaying most hues, with the exception of blue.\nThe dahlia was declared the national flower of Mexico in 1963. The tubers were grown as a food crop by the Aztecs, but this use largely died out after the Spanish Conquest. Attempts to introduce the tubers as a food crop in Europe were unsuccessful."
    },
    "61": {
        "common_name": "Cautleya Spicata",
        "genus": "Cautleya",
        "species": "spicata",
        "wiki_info": "Cautleya spicata is a perennial herbaceous plant in the family Zingiberaceae (the gingers). It is found in the Himalayas through to China (Yunnan). It is cultivated as an ornamental garden plant, hardy to a few degrees of frost.\n\n"
    },
    "62": {
        "common_name": "Japanese Anemone",
        "genus": "Anemone",
        "species": "hupehensis",
        "wiki_info": "Anemone hupehensis, Anemone hupehensis var. japonica, and Anemone × hybrida (commonly known as the Chinese anemone or Japanese anemone, thimbleweed, or windflower) are species of flowering herbaceous perennials in the Ranunculaceae family.\nAnemone × hybrida Paxton is a hybrid of Anemone hupehensis var. japonica and Anemone vitifolia. It should not be confused with Anemone hybrida Miq. ex Pritz., a synonym of Anemone halleri All."
    },
    "63": {
        "common_name": "Black-eyed Susan",
        "genus": "Rudbeckia",
        "species": "hirta",
        "wiki_info": "Rudbeckia hirta, commonly called black-eyed Susan, is a species of flowering plant in the family Asteraceae, native to the Eastern and Central United States. It is one of a number of plants with the common name black-eyed Susan. Other common names for this plant include: brown-eyed Susan, brown Betty, gloriosa daisy, golden Jerusalem, Poorland daisy, yellow daisy, and yellow ox-eye daisy.\nIt is the state flower of Maryland.\nThe plant also is a traditional Native American medicinal herb in several tribal nations; believed in those cultures to be a remedy, among other things, for colds, flu, infection, swelling and (topically, by poultice) for snake bite (although not all parts of the plant are edible)\nParts of the plant have nutritional value. Other parts are not edible.\n\n"
    },
    "64": {
        "common_name": "Silverbush",
        "genus": "Convolvulus",
        "species": "cneorum",
        "wiki_info": "Convolvulus cneorum, also known as silverbush, is a species of flowering plant in the family Convolvulaceae, which contains many plants described as \"bindweed\". However, unlike other species in the genus, it is an evergreen shrub rather than a vine, forming a low mound 0.6–1.2 m (2 ft 0 in–3 ft 11 in) in height, with a similar spread. It produces 2.5–4 cm (1–2 in) diameter flowers which are white with a yellow throat. These are produced at the end of stems in loose panicles and may almost completely cover the plants. The leaves are grey-green and are covered in fine hairs which give the plant a silvery appearance."
    },
    "65": {
        "common_name": "Californian Poppy",
        "genus": "Eschscholzia",
        "species": "californica",
        "wiki_info": "Eschscholzia californica (California poppy, Californian poppy, golden poppy, California sunlight, cup of gold) is a species of flowering plant in the family Papaveraceae, native to the United States and Mexico, and the official state flower of California."
    },
    "66": {
        "common_name": "Osteospermum",
        "genus": "Osteospermum",
        "species": "",
        "wiki_info": "Osteospermum /ˌɒsti.ɵˈspɜrməm/ is a genus of flowering plants belonging to the Calenduleae, one of the smaller tribes of the sunflower/daisy family Asteraceae.\nOsteospermum used to belong to the genus Dimorphotheca, but only the annual species remain in that genus; the perennials belong to Osteospermum. The genus Osteospermum is also closely related to the small genus Chrysanthemoides, such as C. incana and C. monilifera."
    },
    "67": {
        "common_name": "Spring Crocus",
        "genus": "Crocus",
        "species": "vernus",
        "wiki_info": "Crocus vernus (Spring Crocus, Giant Crocus) is a species in Family Iridaceae, native to the Alps, the Pyrenees, and the Balkans. Its cultivars and those of Crocus flavus (Dutch Crocus) are used as ornamental plants. The Dutch Crocusses are larger than the other cultivated crocus species (e.g., Crocus chrysanthus). Depending on the year, Crocus vernus starts flowering about the same time or up to 2 weeks after Crocus chrysanthus (Snow Crocus) starts flowering. Height: 4–6\" (10–15 cm)."
    },
    "68": {
        "common_name": "Bearded Iris",
        "genus": "Iris",
        "species": "",
        "wiki_info": "Iris is a genus of 260–300 species of flowering plants with showy flowers. It takes its name from the Greek word for a rainbow, referring to the wide variety of flower colors found among the many species. As well as being the scientific name, iris is also very widely used as a common name for all Iris species, as well as some belonging to other closely related genera. A common name for some species is 'flags', while the plants of the subgenus Scorpiris are widely known as 'junos', particularly in horticulture. It is a popular garden flower.\nThe often-segregated, monotypic genera Belamcanda (blackberry lily, I. domestica), Hermodactylus (snake's head iris, I. tuberosa), and Pardanthopsis (vesper iris, I. dichotoma) are currently included in Iris."
    },
    "69": {
        "common_name": "Windflower",
        "genus": "Anemone",
        "species": "nemorosa",
        "wiki_info": "Anemone nemorosa is an early-spring flowering plant in the genus Anemone in the family Ranunculaceae, native to Europe. Common names include wood anemone, windflower, thimbleweed, and smell fox, an allusion to the musky smell of the leaves. It is a perennial herbaceous plant growing 5–15 centimetres (2.0–5.9 in) tall."
    },
    "70": {
        "common_name": "Tree Poppy",
        "genus": "Romneya",
        "species": "",
        "wiki_info": "Romneya /ˈrɒmniːə/ is a genus of flowering plants belonging to the poppy family (Papaveraceae). There are two species in genus Romneya, which was named for Irish astronomer John Thomas Romney Robinson. They are known commonly as Matilija poppies (/məˈtɪlɨhɑː/ mə-TIL-i-hah) or tree poppies and are native to southern California and northern Mexico.\nThey are perennial subshrubs with woody stems. They may grow to a height of 2.5 meters (8.2 feet) and a width of 1 m (39 in), with the flowers up to 13 cm (5.1 in) across. The silvery green leaves are deeply cut, with a small fringe of hairs at the margins.\nThey are notable for their large white flowers with intense yellow centers, blooming in summer. Romneya produce the largest flowers of any members of the poppy family. These flowers prefer a warm, sunny spot and fertile soil with good water drainage. They are not easily grown but once established are difficult to remove. In the wild, they are known as \"fire followers\" as they can be frequently, but not exclusively, found in burned areas. It is also known as the \"fried egg flower\" or \"fried egg plant\".\n\nThe two species are:\nRomneya coulteri Harv. - Coulter's Matilija poppy\nRomneya trichocalyx Eastw. - Bristly Matilija poppy. Some consider this a variety of Romneya coulteri, but it is accepted in recent manuals."
    },
    "71": {
        "common_name": "Gazania",
        "genus": "Gazania",
        "species": "",
        "wiki_info": "Gazania /ɡəˈzeɪniə/ is a genus of flowering plants in the family Asteraceae, native to Southern Africa.\nThey produce large, daisy-like composite flowers in brilliant shades of yellow and orange, over a long period in summer. They are often planted as drought-tolerant groundcover.\n\n"
    },
    "72": {
        "common_name": "Azalea",
        "genus": "Rhododendron",
        "species": "Pentanthera & Tsutsuji",
        "wiki_info": "Azaleas /əˈzeɪliə/ are flowering shrubs in the genus Rhododendron, particularly sections Tsutsuji (evergreen) and Pentanthera (deciduous). Azaleas bloom in spring, their flowers often lasting several weeks. Shade tolerant, they prefer living near or under trees. They are part of the Ericaceae family."
    },
    "73": {
        "common_name": "Water Lily",
        "genus": "Nymphaeaceae",
        "species": "",
        "wiki_info": "Nymphaeaceae /ˌnɪmfiːˈeɪsiː/ is a family of flowering plants. Members of this family are commonly called water lilies and live as rhizomatous aquatic herbs in temperate and tropical climates around the world. The family contains eight large-flowered genera with about 70 species. The genus Nymphaea contains about 35 species in the Northern Hemisphere. The genus Victoria contains two species of giant water lilies endemic to South America. Water lilies are rooted in soil in bodies of water, with leaves and flowers floating on the surface. The leaves are round, with a radial notch in Nymphaea and Nuphar, but fully circular in Victoria.\nWater lilies are a well studied clade of plants because their large flowers with multiple unspecialized parts were initially considered to represent the floral pattern of the earliest flowering plants, and later genetic studies confirmed their evolutionary position as basal angiosperms. Analyses of floral morphology and molecular characteristics and comparisons with a sister taxon, the family Cabombaceae, indicate, however, that the flowers of extant water lilies with the most floral parts are more derived than the genera with fewer floral parts. Genera with more floral parts, Nuphar, Nymphaea, Victoria, have a beetle pollination syndrome, while genera with fewer parts are pollinated by flies or bees, or are self- or wind-pollinated. Thus, the large number of relatively unspecialized floral organs in the Nymphaeaceae is not an ancestral condition for the clade.\nHorticulturally water lilies have been hybridized for temperate gardens since the nineteenth century, and the hybrids are divided into three groups: hardy, night-blooming tropical, and day-blooming tropical water lilies. Hardy water lilies are hybrids of Nymphaea species from the subgenus Castalia; night-blooming tropical water lilies are developed from the subgenus Lotos; and the day-blooming tropical plants arise from hybridization of plants of the subgenus Brachyceras.\n^ \n^ a b c [1]\n^ Phylogeny, Classification and Floral Evolution of Water Lilies (Nymphaeaceae; Nymphaeales): A Synthesis of Non-molecular, rbcL, matK, and 18S rDNA Data, Donald H. Les, Edward L. Schneider, Donald J. Padgett, Pamela S. Soltis, Douglas E. Soltis and Michael Zanis, Systematic Botany, Vol. 24, No. 1, 1999, pp. 28-46\n^ Evolution of garden Nymphaeas, G. V. Subrahmanyam and T. N. Khoshoo, Current Science, 53(7), 360-363, 1984\n^ Nymphaeaceae, Nymphaea belophylla Trickett: New state record, Gisaine de Andrade Amador, Geraldo Alves Damasceno-Júnior,, Rosa Helena da Silva, Arnildo Pott and Vali Joana Pott, Check List 9(2): 440–442, 2013"
    },
    "74": {
        "common_name": "Rose",
        "genus": "Rosa",
        "species": "",
        "wiki_info": "A rose (/ˈroʊz/) is a woody perennial of the genus Rosa, within the family Rosaceae. There are over 100 species and thousands of cultivars. They form a group of plants that can be erect shrubs, climbing or trailing with stems that are often armed with sharp prickles. Flowers vary in size and shape and are usually large and showy, in colours ranging from white through yellows and reds. Most species are native to Asia, with smaller numbers native to Europe, North America, and northwest Africa. Species, cultivars and hybrids are all widely grown for their beauty and often are fragrant. Rose plants range in size from compact, miniature roses, to climbers that can reach seven meters in height. Different species hybridize easily, and this has been used in the development of the wide range of garden roses.\nThe name rose comes from French, itself from Latin rosa, which was perhaps borrowed from Oscan, from Greek ρόδον rhódon (Aeolic βρόδον wródon), itself borrowed from Old Persian wrd- (wurdi), related to Avestan varəδa, Sogdian ward, Parthian wâr."
    },
    "75": {
        "common_name": "Thorn Apple",
        "genus": "Crataegus",
        "species": "",
        "wiki_info": "Crataegus /krəˈtiːɡəs/, commonly called hawthorn, thornapple, May-tree, whitethorn, or hawberry, is a large genus of shrubs and trees in the family Rosaceae, native to temperate regions of the Northern Hemisphere in Europe, Asia and North America. The name \"hawthorn\" was originally applied to the species native to northern Europe, especially the common hawthorn C. monogyna, and the unmodified name is often so used in Britain and Ireland. The name is now also applied to the entire genus and to the related Asian genus Rhaphiolepis. The name haw, originally an Old English term for hedge, applies to the fruit."
    },
    "76": {
        "common_name": "Morning Glory",
        "genus": "Ipomoea (guessed)",
        "species": "purpurea",
        "wiki_info": "Morning glory is the common name for over 1,000 species of flowering plants in the family Convolvulaceae, whose current taxonomy and systematics are in flux. Morning glory species belong to many genera.d"
    },
    "77": {
        "common_name": "Passion Flower",
        "genus": "Passiflora",
        "species": "",
        "wiki_info": "Passiflora, known also as the passion flowers or passion vines, is a genus of about 500 species of flowering plants, the namesakes of the family Passifloraceae.\nThey are mostly vines, with some being shrubs, and a few species being herbaceous. For information about the fruit of the passiflora plant, see passionfruit. The monotypic genus Hollrungia seems to be inseparable from Passiflora, but further study is needed."
    },
    "78": {
        "common_name": "Lotus",
        "genus": "Nelumbo",
        "species": "nucifera",
        "wiki_info": "Nelumbo nucifera, also known as Indian lotus, sacred lotus, bean of India, or simply lotus, is one of two species of aquatic plant in the family Nelumbonaceae. The Linnaean binomial Nelumbo nucifera (Gaertn.) is the currently recognized name for this species, which has been classified under the former names, Nelumbium speciosum (Willd.) and Nymphaea nelumbo, among others. (These names are obsolete synonyms and should be avoided in current works.) This plant is an aquatic perennial. Under favorable circumstances its seeds may remain viable for many years, with the oldest recorded lotus germination being from that of seeds 1,300 years old recovered from a dry lakebed in northeastern China.\nNative to Tropical Asia and Queensland, Australia, it is commonly cultivated in water gardens. It is also the national flower of India and Vietnam.\n^ Shen-Miller, J.; Schopf, J. W.; Harbottle, G.; Cao, R.-j.; Ouyang, S.; Zhou, K.-s.; Southon, J. R.; Liu, G.-h. (2002). \"Long-living lotus: Germination and soil -irradiation of centuries-old fruits, and cultivation, growth, and phenotypic abnormalities of offspring\". American Journal of Botany 89 (2): 236–47. doi:10.3732/ajb.89.2.236. PMID 21669732. \n^ Perry, F. Flowers of the World Bonanza Books, 1972. p. 192-193\n^ Serventy, V; Raymond, R. Lakes & Rivers of Australia Summit Books, 1980. p. 102-103"
    },
    "79": {
        "common_name": "Toad Lily",
        "genus": "Tricyrtis",
        "species": "",
        "wiki_info": "Tricyrtis is a genus of Asian flowering plants in the lily family, with approximately 20 known species. The species are commonly known in English as Toad lilies. It has a native range from the Himalayas to eastern Asia, including China, Japan, Philippines and Taiwan, and a few species are cultivated for their ornamental qualities in other parts of the world."
    },
    "80": {
        "common_name": "Anthurium",
        "genus": "Anthurium",
        "species": "",
        "wiki_info": "Anthurium (/ænˈθjuːriəm/; Schott, 1829), is a genus of about 1000 species of flowering plants, the largest genus of the arum family, Araceae. General common names include anthurium, tailflower, flamingo flower, and laceleaf.\nThe genus is native to the Americas, where it is distributed from northern Mexico to northern Argentina and parts of the Caribbean."
    },
    "81": {
        "common_name": "Frangipani",
        "genus": "Plumeria",
        "species": "",
        "wiki_info": "Plumeria (/pluːˈmiəriə/; common name Frangipani) is a genus of flowering plants in the dogbane family, Apocynaceae. It contains primarily deciduous shrubs and small trees. They are native to Central America, Mexico, the Caribbean, and South America as far south as Brazil but can be grown in tropical and sub-tropical regions."
    },
    "82": {
        "common_name": "Clematis",
        "genus": "Clematis",
        "species": "",
        "wiki_info": "Clematis is a genus of about 300 species within the buttercup family Ranunculaceae. Their garden hybrids have been popular among gardeners, beginning with Clematis × jackmanii, a garden standby since 1862; more hybrid cultivars are being produced constantly. They are mainly of Chinese and Japanese origin. Most species are known as clematis in English, while some are also known as traveller's joy, a name invented for the sole British native, C. vitalba, by the herbalist John Gerard; virgin's bower for C. viticella; old man's beard, applied to several with prominent seedheads; leather flower for those with fleshy petals; or vase vine for the North American Clematis viorna."
    },
    "83": {
        "common_name": "Hibiscus",
        "genus": "Hibiscus",
        "species": "",
        "wiki_info": "Hibiscus (/hɨˈbɪskəs/ or /haɪˈbɪskəs/) is a genus of flowering plants in the mallow family, Malvaceae. It is quite large, containing several hundred species that are native to warm-temperate, subtropical and tropical regions throughout the world. Member species are often noted for their showy flowers and are commonly known simply as hibiscus, or less widely known as rose mallow. The genus includes both annual and perennial herbaceous plants, as well as woody shrubs and small trees. The generic name is derived from the Greek word ἱβίσκος (hibískos), which was the name Pedanius Dioscorides (ca. 40–90) gave to Althaea officinalis."
    },
    "84": {
        "common_name": "Columbine",
        "genus": "Aquilegia",
        "species": "",
        "wiki_info": "Aquilegia (common names: Granny's Bonnet or Columbine) is a genus of about 60-70 species of perennial plants that are found in meadows, woodlands, and at higher altitudes throughout the Northern Hemisphere, known for the spurred petals  of their flowers."
    },
    "85": {
        "common_name": "Desert-rose",
        "genus": "Adenium",
        "species": "",
        "wiki_info": "Adenium is a genus of flowering plants in the dogbane family, Apocynaceae, first described as a genus in 1819. It is native to Africa and to the Arabian Peninsula."
    },
    "86": {
        "common_name": "Tree Mallow",
        "genus": "Lavatera",
        "species": "",
        "wiki_info": "Lavatera is a genus of about 25 species of flowering plants in the family Malvaceae, native to the Mediterranean region, central and eastern Asia, North America (California and Mexico) and Australia. A number of species are naturalized in North America.\nMany Lavatera species have now been transferred to the related genus Malva. Lavatera species are known as tree mallows, or rather ambiguously as rose mallows, royal mallows or annual mallows.\nThe genus includes annual, biennial and perennial herbaceous plants and soft-wooded shrubs, growing from 1–3 m tall. The leaves are spirally arranged, and palmately lobed. The flowers are conspicuous, 4–12 cm diameter, with five white, pink or red petals; they are produced in terminal clusters.\nLavatera species are used as food plants by the larvae of some Lepidoptera species including Bucculatrix lavaterella, which feeds exclusively on these plants. Flowers and seeds of several species are also used as food by humans."
    },
    "87": {
        "common_name": "Magnolia",
        "genus": "magnolia",
        "species": "",
        "wiki_info": "Magnolia is a large genus of about 210 flowering plant species in the subfamily Magnolioideae of the family Magnoliaceae. It is named after French botanist Pierre Magnol.\nMagnolia is an ancient genus. Appearing before bees did, the flowers are theorized to have evolved to encourage pollination by beetles. To avoid damage from pollinating beetles, the carpels of Magnolia flowers are extremely tough. Fossilised specimens of M. acuminata have been found dating to 20 million years ago, and of plants identifiably belonging to the Magnoliaceae date to 95 million years ago. Another aspect of Magnolia considered to represent an ancestral state is the flower bud is enclosed in a bract rather than in sepals; the perianth parts are undifferentiated and called tepals rather than distinct sepals and petals. Magnolia shares the tepal characteristic with several other flowering plants near the base of the flowering plant lineage such as Amborella and Nymphaea (as well as with many more recently derived plants such as Lilium).\nThe natural range of Magnolia species is a disjunct distribution, with a main centre in east and southeast Asia and a secondary centre in eastern North America, Central America, the West Indies, and some species in South America."
    },
    "88": {
        "common_name": "Cyclamen",
        "genus": "cyclamen",
        "species": "",
        "wiki_info": "Cyclamen (US /ˈsaɪkləmɛn/ SY-klə-men or UK /ˈsɪkləmɛn/ SIK-lə-men) is a genus of 23 species of perennial flowering plants in the family Primulaceae. Cyclamen species are native to Europe and the Mediterranean Basin east to Iran, with one species in Somalia. They grow from tubers and are valued for their flowers with upswept petals and variably patterned leaves.\nIt was traditionally classified in the family Primulaceae, was reclassified in the family Myrsinaceae in 2000, and finally, in 2009 with the introduction of the APG III system, was returned to the subfamily Myrsinoideae within the family Primulaceae."
    },
    "89": {
        "common_name": "Watercress",
        "genus": "(it is a family)",
        "species": "",
        "wiki_info": "Watercress, with the botanical name Nasturtium officinale, is a rapidly growing, aquatic or semi-aquatic, perennial plant native to Europe and Asia, and one of the oldest known leaf vegetables consumed by humans. It is currently a member of the family Brassicaceae, botanically related to garden cress, mustard, radish and wasabi—all noteworthy for their piquant flavor.\nThe hollow stems of watercress are floating, and the leaves are pinnately compound. Small, white and green flowers are produced in clusters."
    },
    "90": {
        "common_name": "Canna Lily",
        "genus": "Canna",
        "species": "",
        "wiki_info": "Canna (or canna lily, although not a true lily) is a genus of 19 species of flowering plants. The closest living relations to cannas are the other plant families of the order Zingiberales, that is the Zingiberaceae (gingers), Musaceae (bananas), Marantaceae, Heliconiaceae, Strelitziaceae, etc.\nCanna is the only genus in the family Cannaceae. The APG II system of 2003 also recognizes the family, and assigns it to the order Zingiberales in the clade commelinids, in the monocots.\nThe species have large, attractive foliage, and horticulturists have turned it into a large-flowered and bright garden plant. In addition, it is one of the world's richest starch sources, and is an agricultural plant.\nAlthough a plant of the tropics, most cultivars have been developed in temperate climates and are easy to grow in most countries of the world as long as they receive at least 6–8 hours average sunlight during the summer, and are moved to a warm location for the winter. See the Canna cultivar gallery for photographs of Canna cultivars.\nThe name Canna originates from the Latin word for a cane or reed.\n\n"
    },
    "91": {
        "common_name": "Hippeastrum",
        "genus": "Hippeastrum",
        "species": "",
        "wiki_info": "Hippeastrum /ˌhɪpiːˈæstrəm/ is a genus of about 90 species and over 600 hybrids and cultivars of perennial herbaceous bulbous plants. They generally have large fleshy bulbs and tall broad leaves, generally evergreen, and large red or purple flowers.\nHippeastrum is a genus in the family Amaryllidaceae (subfamily Amaryllidoideae, tribe Hippeastreae, and subtribe Hippeastrineae) The name Hippeastrum, given to it by William Herbert, means \"Knight's-star-lily\", although precisely what Herbert meant by the name is not certain. For many years there was confusion among botanists over the generic names Amaryllis and Hippeastrum, one result of which is that the common name \"amaryllis\" is mainly used for cultivars of this genus, often sold as indoor flowering bulbs particularly at Christmas in the northern hemisphere. By contrast the generic name Amaryllis applies to bulbs from South Africa, usually grown outdoors. The genus is native to tropical and subtropical regions of the Americas from Argentina north to Mexico and the Caribbean.\nReproduction is generally by allogamy (cross-pollination) and Hippeastrum may be propagated by seed or offset bulbils (bulblets), although commercial ventures use in vitro techniques, or splitting of the bulb into sections. The genus has been intensely bred and cultivated since the early nineteenth century to produce large colourful showy flowers. In temperate climes these can be placed outside in the summer, and after a dormancy period, be induced to rebloom inside in the winter.\n^ WCSP 2015.\n^ Herbert 1821, Hippeastrum Appendix: 31 (1821), nom. cons..\n^ \n^ Tropicos, Hippeastrum Herb.\n^ a b c Salisbury & Gray 1866, Gen. Pl. p. 134.\n^ Rafinesque 1838, Fl. Tellur. 4: 10.\n^ Link 1829, Handbuch 1: 193 .\n^ Koster 1816, Appendix Trav. Brazil: 493 .\n^ Salisbury & Gray 1866, Gen. Pl. p. 135.\n^ a b Rafinesque 1838, Fl. Tellur. 4: 11.\n^ Trans. Hort. Soc. London 4: 181 (1821), nom. rej. rejected homonym not Parl. 1845\n^ Rusby 1927, Mem. New York Bot. Gard. 7: 214.\n^ Pl. Life 7: 41 (1951).\n^ WCSP 2015, Synonyms .\n^ \n^"
    },
    "92": {
        "common_name": "Bee Balm",
        "genus": "Monarda",
        "species": "",
        "wiki_info": "Monarda is a genus of flowering plants in the mint family, Lamiaceae. The genus is endemic to North America. Common names include bee balm, horsemint, oswego tea, and bergamot, the latter inspired by the fragrance of the leaves, which is reminiscent of bergamot orange (Citrus bergamia). The genus was named for the Spanish botanist Nicolás Monardes, who wrote a book in 1574 describing plants of the New World."
    },
    "93": {
        "common_name": "Ball Moss",
        "genus": "Tillandsia",
        "species": "recurvata",
        "wiki_info": "Tillandsia recurvata, commonly known as Ball Moss, is a flowering plant (not a true moss) that grows upon larger host plants. It grows well in areas with low light, little airflow, and high humidity, which is commonly provided by southern shade trees, often the Southern Live Oak (Quercus virginiana). It is not a parasite like mistletoe, but an epiphyte like its relative Spanish moss.\nTillandsia recurvata derives mainly physical support and not nutrition from its host; it photosynthesizes its own food, receiving water vapor from the air. It obtains nitrogen from bacteria, and other minerals largely from blown dust. Though not a harmful parasite in the same sense as plants such as mistletoes that feed on the sap of the host, Ball Moss may compete with a host tree for sunlight and some nutrients, and by restricting available surface area for new branch sprouts; however, except on stressed host trees (e.g., in some urban settings) it rarely has a noticeable effect on growth or health.\nIn habit, Tillandsia recurvata tends to form a spheroid ranging in size from a golf ball to a soccer ball. Most seedlings germinate on tiny branches and less often on vertical bark of tree hosts, which has been suggested to indicate that local spread of Ball Moss is mainly by seeds sprouting from bird droppings on stems of shrubs and trees. Rival authorities suggest that wind is the main agent of seed dispersal. Mature seeds have no apparent adhesive on the exterior, and very little nutrient supply to support sprouting, but, like many other epiphyte seeds, they are borne plentifully and are armed with fine, straight hairs that could well adhere to wet or clinging surfaces, such as rough bark. In fact, as shown in the accompanying photograph, they even grow plentifully on fences and telegraph wires, together with occasional other species.\n\nBall Moss is sensitive to freezing, particularly when moist.\nBall Moss is indigenous to the warmer regions of the Americas; it ranges from the southern United States to northern Argentina and Chile. The northernmost limit of its natural occurrence is coastal Georgia (where it is listed as a State \"Special Concern\" species), although it has been introduced into coastal South Carolina on landscaping trees. It has been reported in nature from Georgia, Florida, Louisiana, Texas, Arizona, Mexico, most of Central and South America, and many of the islands in the West Indies."
    },
    "94": {
        "common_name": "Foxglove",
        "genus": "Digitalis",
        "species": "",
        "wiki_info": "Digitalis (/ˌdɪdʒɨˈteɪlɨs/ or /ˌdɪdʒɨˈtælɨs/) is a genus of about 20 species of herbaceous perennials, shrubs, and biennials commonly called foxgloves.\nThis genus was traditionally placed in the figwort family Scrophulariaceae, but recent phylogenetic research has placed it in the much enlarged family Plantaginaceae. This genus is native to western and southwestern Europe, western and central Asia, Australasia and northwestern Africa. The scientific name means \"finger-like\" and refers to the ease with which a flower of Digitalis purpurea can be fitted over a human fingertip. The flowers are produced on a tall spike, are tubular, and vary in colour with species, from purple to pink, white, and yellow. The best-known species is the common foxglove, Digitalis purpurea. This biennial plant is often grown as an ornamental plant due to its vivid flowers which range in colour from various purple tints through various shades of light gray, and to purely white. The flowers can also possess various marks and spottings.\nThe first year of growth of the common foxglove produces only the stem with its long, basal leaves. During the second year of the plant's life, a long, leafy stem from 50 to 255 centimeters tall grows atop the roots of healthy plants.\nThe larvae of the moth the \"foxglove pug\" consume the flowers of the common foxglove for food. Other species of Lepidoptera eat the leaves, including the lesser yellow underwing.\nThe term digitalis is also used for drug preparations that contain cardiac glycosides, particularly one called digoxin, extracted from various plants of this genus."
    },
    "95": {
        "common_name": "Bougainvillea",
        "genus": "Bougainvillea",
        "species": "",
        "wiki_info": "Bougainvillea (/ˌbuːɡɨnˈvɪliə/ or /ˌboʊɡɨnˈvɪliə/) is a genus of thorny ornamental vines, bushes, and trees with flower-like spring leaves near its flowers. Different authors accept between four and 18 species in the genus. They are native plants of South America from Brazil west to Perú and south to southern Argentina (Chubut Province). Bougainvillea are also known as buganvilla (Spain), bugambilia (Mexico), Napoleón (Honduras), veranera (Colombia, Nicaragua, El Salvador, Costa Rica and Panama), trinitaria (Colombia, Cuba, Panama, Puerto Rico, Dominican Republic & Venezuela), Santa Rita (Argentina, Bolivia, Brazil, Paraguay and Uruguay) or papelillo (northern Peru).\nThe vine species grow anywhere from 1 to 12 m (3 to 40 ft.) tall, scrambling over other plants with their spiky thorns. The thorns are tipped with a black, waxy substance. They are evergreen where rainfall occurs all year, or deciduous if there is a dry season. The leaves are alternate, simple ovate-acuminate, 4–13 cm long and 2–6 cm broad. The actual flower of the plant is small and generally white, but each cluster of three flowers is surrounded by three or six bracts with the bright colours associated with the plant, including pink, magenta, purple, red, orange, white, or yellow. Bougainvillea glabra is sometimes referred to as \"paper flower\" because the bracts are thin and papery. The fruit is a narrow five-lobed achene.\nBougainvillea are relatively pest-free plants, but may suffer from worms, snails and aphids. The larvae of some Lepidoptera species also use them as food plants, for example the giant leopard moth (Hypercompe scribonia)."
    },
    "96": {
        "common_name": "Camellia",
        "genus": "Camellia",
        "species": "",
        "wiki_info": "Camellia is a genus of flowering plants in the family Theaceae. They are found in eastern and southern Asia, from the Himalayas east to Japan and Indonesia. There are 100–250 described species, with some controversy over the exact number. The genus was named by Linnaeus after the Jesuit botanist Georg Joseph Kamel, who worked in the Philippines, though he never described a camellia. This genus is famous throughout East Asia; camellias are known as cháhuā (茶花) in Chinese, \"tea flower\", an apt designation, as tsubaki (椿) in Japanese, as dongbaek-kkot (동백꽃) in Korean and as hoa trà or hoa chè in Vietnamese.\nOf economic importance in the Indian subcontinent and Asia, leaves of C. sinensis are processed to create the popular beverage, tea. The ornamental Camellia japonica, Camellia oleifera and Camellia sasanqua and their hybrids are represented in cultivation by a large number of cultivars."
    },
    "97": {
        "common_name": "Mallow",
        "genus": "Malva",
        "species": "",
        "wiki_info": "Malva is a genus of about 25–30 species of herbaceous annual, biennial, and perennial plants in the family Malvaceae (of which it is the type genus), one of several closely related genera in the family to bear the common English name mallow. The genus is widespread throughout the temperate, subtropical and tropical regions of Africa, Asia and Europe. The word \"mallow\" is derived from Old English \"malwe\", which was imported from Latin \"malva\", cognate with Ancient Greek μαλάχη (malakhē) meaning \"mallow\", both perhaps reflecting a Mediterranean term. A number of species, previously considered to belong to Lavatera, have been moved to Malva.\nThe leaves are alternate, palmately lobed. The flowers are from 0.5–5 cm diameter, with five pink or white petals.\nThe colour mauve was in 1859 named after the French name for this plant."
    },
    "98": {
        "common_name": "Mexican Petunia",
        "genus": "Ruellia",
        "species": "angustifolia",
        "wiki_info": "Ruellia is a genus of flowering plants commonly known as ruellias or wild petunias. They are not closely related to petunias (Petunia) although both genera belong to the same euasterid clade. The genus was named in honor of Jean Ruelle, herbalist and physician to Francis I of France and translator of several works of Dioscorides.\nApart from the numerous formerly independent genera nowadays considered synonymous with Ruellia, the segregate genera Blechum, Eusiphon, Polylychnis and Ulleria are often included in Ruellia. Acanthopale, however, is considered a distinct genus.\nRuellias are popular ornamental plants. Some are used as medicinal plants, but many are known or suspected to be poisonous. Their leaves are food for the caterpillars of several Lepidoptera (butterflies and moths), typically Nymphalinae and in particular members of their tribe Junoniini. Nymphalinae using Ruellia as host plants include the Common Buckeye (Junonia coenia), recorded on R. nodiflora, the Lemon Pansy (Junonia lemonias), recorded on R. tuberosa, and th Malachite Butterfly (Siproeta stelenes) and Australian Lurcher (Yoma sabina), which are recorded on several species."
    },
    "99": {
        "common_name": "Bromelia",
        "genus": "Bromelia",
        "species": "",
        "wiki_info": "Bromelia is a genus of the botanical family Bromeliaceae, subfamily Bromelioideae. Bromelia species are widespread across much of Latin America and the West Indies, and are characterized by flowers with a deeply cleft calyx. The genus is named after the Swedish medical doctor and botanist Olof Bromelius (1639-1705)."
    },
    "100": {
        "common_name": "Blanket Flower",
        "genus": "Gaillardia",
        "species": "",
        "wiki_info": "Gaillardia /ɡeɪˈlɑrdiə/, the blanket flowers, is a genus of flowering plants in the sunflower family, Asteraceae, native to North and South America. It was named after an M. Gaillard de Charentonneau, an 18th-century French magistrate who was a patron of botany. The common name may refer to the resemblance of the inflorescence to the brightly patterned blankets made by Native Americans, or to the ability of wild taxa to blanket the ground with colonies. Many cultivars have been bred for ornamental use.\n\n"
    },
    "101": {
        "common_name": "Trumpet Creeper",
        "genus": "Campsis",
        "species": "radicans",
        "wiki_info": "Campsis radicans (trumpet vine or trumpet creeper, also known in North America as cow itch vine or hummingbird vine), is a species of flowering plant of the family Bignoniaceae, native to the eastern United States and naturalized in parts of the western United States as well as in Ontario, parts of Europe, and scattered locations in Latin America. Growing to 10 m (33 ft), it is a vigorous, deciduous woody vine, notable for its showy trumpet-shaped flowers. It inhabits woodlands and riverbanks, and is also a popular garden subject.\n\n"
    },
    "102": {
        "common_name": "Blackberry Lily",
        "genus": "Iris",
        "species": "domestica",
        "wiki_info": "Iris domestica (blackberry lily, leopard flower, leopard lily is an ornamental plant in the Iridaceae family. In 2005, based on molecular DNA sequence evidence, Belamcanda chinensis, the sole species in the genus Belamcanda, was transferred to the genus Iris and renamed Iris domestica. Other synonyms are Epidendrum domesticum L., Vanilla domestica (L.) Druce, Belamcanda punctata Moench, Gemmingia chinensis (L.) Kuntze, Ixia chinensis L., Morea chinensis, and Pardanthus chinensis Ker Gawl.)"
    }
}
